[{"levelID":427,"conditions":[12,0,10,50,3,12],"messages":[{"c":"Pastafarian","m":"As I thought. Even without dislodging any, cracked tiles are sparse over here."},{"c":"Pastafarian","m":"Is that intentional?"},{"c":"Gentleman","m":"Those tiles have a unique and highly annoying tendency to detach from my manipulator ring. This has naturally delayed the collection process."},{"c":"Pastafarian","m":"Oh. That sounds like a pain."},{"c":"Gentleman","m":"Nonetheless, I assure you that this challenge will be saturated by the time of the grand opening."},{"c":"Pastafarian","m":"And may His Noodly Appendage lighten your load."}]},{"flags":[0,37,8],"levelID":428,"conditions":[5,0,10,70,10,10],"messages":[{"c":"Pastafarian","m":"I'm sorry, I didn't intend to literally walk all over your challenge. I'll try again."},{"c":"Gentleman","m":"No need. You've earned the right to bypass courses like this."},{"c":"Pastafarian","m":"How so? I'm not sure I deserve any form of special treatment."},{"c":"Gentleman","m":"You invested time and effort to earn that bridge. I am not one to complain when an investment pays off."},{"c":"Pastafarian","m":"I don't recall investing either of those into this bridge. It took form on its own when I arrived."},{"c":"Gentleman","m":"You earned it by being diligent in the practice of your faith, did you not?"},{"c":"Pastafarian","m":"Well, yes, when you put it that way. What else could it be?"},{"c":"Pastafarian","m":"Wait."},{"c":"Pastafarian","m":"You believe in the Flying Spaghetti Monster?"},{"c":"Gentleman","m":"No, but I do recognize a return on an investment when I see one."}]},{"levelID":429,"conditions":[11,15,106,0,110,0,110,4,110,5,0],"messages":[{"c":"Gentleman","m":"Should I be insulted at your aversion to the slightest contact with my challenge? A challenge whose construction process, I remind you, has consumed months of my time."},{"c":"Pastafarian","m":"No, um-"},{"c":"Gentleman","m":"Don't worry, that was in jest. As a matter of fact I'm moderately impressed you managed it."},{"c":"Pastafarian","m":"Oh, haha. In that case, thanks."},{"c":"Pastafarian","m":"Hang on. When you said you spent months building this singular challenge, was that an exaggeration?"},{"c":"Gentleman","m":"I spent months on these challenges collectively, not this challenge alone. The length of time spent is no exaggeration."},{"c":"Pastafarian","m":"I admire your dedication."},{"c":"Gentleman","m":"Indeed, but it's my hope I can enlist some employees. Do you know where I might find one capable of quickly bridging gaps?"},{"c":"Pastafarian","m":"My apologies, but I'm unable to commit that much of my time."},{"c":"Gentleman","m":"I should mention that I am able to compensate any and all employees extremely handsomely."},{"c":"Pastafarian","m":"You certainly should mention that, but not to me. I already have what little money I need."},{"c":"Pastafarian","m":"When I next talk to the others, I'll make sure to pass along your requests."}]},{"levelID":422,"conditions":[11,10,110,0,110,2,110,4,110,5,0],"messages":[{"c":"Pastafarian","m":"I've been talking to the Angel."},{"c":"Gentleman","m":"My condolences."},{"c":"Pastafarian","m":"Please be serious."},{"c":"Gentleman","m":"I am. Time spent talking to the Angel is time wasted."},{"c":"Pastafarian","m":"What about time spent attempting to convert the Angel?"},{"c":"Pastafarian","m":"If he could learn to see the universe from a Pastafarian perspective, both he and those around him would greatly benefit."},{"c":"Pastafarian","m":"Regardless of the effort required, one can hardly call that a waste."},{"c":"Gentleman","m":"I'm sorry, but I can hardly imagine the Angel admitting fault, much less making any show of faith."},{"c":"Pastafarian","m":"Thanks so much for the vote of confidence."},{"c":"Gentleman","m":"I'm merely reminding you that there exist far more profitable uses of your time."},{"c":"Pastafarian","m":"I'll leave you out of it, but I must try."},{"c":"Gentleman","m":"Hmph. If you insist."}]},{"flags":[0,0,0,32],"levelID":426,"conditions":[110,18,10,30,114,2041,10,74,0],"messages":[{"c":"Pastafarian","m":"No problem, I finished anyway."},{"c":"Gentleman","m":"Oh."},{"c":"Gentleman","m":"Congratulations. I thought I had you there."},{"c":"Gentleman","m":"In any case..."}]},{"levelID":426,"conditions":[110,18,10,30,114,2041,10,74],"messages":[{"c":"Pastafarian","m":"Oh."},{"c":"Gentleman","m":"Heh. I take it you didn't expect to encounter that ruse twice in a row?"},{"c":"Pastafarian","m":"Not particularly."},{"c":"Gentleman","m":"That's the beauty of my stratagem: after evading a trap, your natural instinct is to attempt to outsmart me by anticipating something entirely new."},{"c":"Gentleman","m":"But I anticipated your anticipation of me, letting me subvert your expectations."},{"c":"Pastafarian","m":"I don't buy it."},{"c":"Gentleman","m":"It was effective, was it not?"},{"c":"Pastafarian","m":"Not exactly. You created some uncertainty, but the scenario remained on my mind nonetheless."},{"c":"Pastafarian","m":"Since I was considering the possibility, I spotted it well in advance. Then I chose to walk into it."},{"c":"Gentleman","m":"Why?"},{"c":"Pastafarian","m":"To see what avenues of escape might be available to those without my bridge."},{"c":"Gentleman","m":"Hmm... ok. And the verdict?"},{"c":"Pastafarian","m":"If not for the ease with which this trap can be avoided, I'd chide you for building it."},{"c":"Gentleman","m":"I can appreciate that reasoning."}]},{"name":"Thanks for Playtesting","dismissOld":false,"levelID":-1,"conditions":[1,12,1,5],"messages":[{"c":"Gentleman","m":"I'm afraid I've yet to build the remainder of this training course, but thank you for providing feedback on what currently exists."},{"c":"Gentleman","m":"Your efforts were invaluable for identifying weaknesses in my product."},{"c":"Pastafarian","m":"It was fun! Thank you for giving me a place to blow off steam."},{"c":"Gentleman","m":"If you have time, I constructed another set of challenges for which I could use feedback."},{"c":"Pastafarian","m":"Not right now. I should go touch base with the Runner."},{"c":"Pastafarian","m":"Speaking of whom, do you know where she went?"}]},{"ordered":false,"levelID":425,"conditions":[101,180,101,180,110,18,110,4],"messages":[{"c":"Gentleman","m":"Why are you imposing additional restrictions on yourself?"},{"c":"Pastafarian","m":"Well... I mean no offense, but some of your challenges aren't very challenging."},{"c":"Gentleman","m":"I'm well aware. In order to maximize my potential customer base, I've ensured that these challenges are accessible to all."},{"c":"Pastafarian","m":"Ah."},{"c":"Pastafarian","m":"Then why call them challenges? You usually value precision in your word choice."},{"c":"Gentleman","m":"Marketing! Members of the general public enjoy believing they are overcoming enormous obstacles."},{"c":"Pastafarian","m":"So marketing isn't just dishonest, it's uncharitable?"},{"c":"Gentleman","m":"No, not at all. I'm, uh... merely keeping in mind that the general public lacks our level of experience."},{"c":"Gentleman","m":"To them, these challenges will indeed be challenging."},{"c":"Pastafarian","m":"I suppose."},{"c":"Pastafarian","m":"But then you should understand why I chose to impose additional restrictions on myself."},{"c":"Pastafarian","m":"My level of experience is such that your challenge alone failed to challenge me."},{"c":"Gentleman","m":"Point duly noted."},{"c":"Gentleman","m":"I don't suppose I could monetize this idea... How much value did these restrictions add to your experience?"},{"c":"Pastafarian","m":"I... have no idea how to answer that."},{"c":"Gentleman","m":"I'm not expecting an exact amount of money. Feel free to round."},{"c":"Pastafarian","m":"No, seriously. I can't answer that."}]},{"flags":[0,1,8],"levelID":430,"conditions":[110,18,112,890,10,5],"messages":[{"c":"Pastafarian","m":"How was I meant to continue from that point?"},{"c":"Gentleman","m":"I suggest re-evaluating your route."},{"c":"Pastafarian","m":"I realize superior routes exist, but that particular ramp still leaves a bad taste in my mouth."},{"c":"Gentleman","m":"Then I suggest not tasting that particular ramp."},{"c":"Pastafarian","m":"Did you just-"},{"c":"Pastafarian","m":"Heh, touché."},{"c":"Pastafarian","m":"Nonetheless, a ramp invites leaping off, and promises the opportunity to land afterwards."},{"c":"Gentleman","m":"No such promise exists or will exist in any of my contracts."},{"c":"Pastafarian","m":"Then it implicitly promises such. Either way, I took a leap of faith, and my faith went unrewarded. Such experiences are never pleasant."},{"c":"Gentleman","m":"...I see. However, I project a low monetary impact, so I cannot assign this a high priority."}]}]